In [3]:
import pandas as pd
from sqlalchemy import create_engine

engine = create_engine(
    "postgresql://neondb_owner:npg_LiBRpTC5D0hN@ep-sparkling-glade-a1lz63fj-pooler.ap-southeast-1.aws.neon.tech/neondb?sslmode=require&channel_binding=require"
)

query = """
SELECT
    customerid,
    recency,
    frequency,
    monetary,
    r_score,
    f_score,
    m_score,
    rfm_score,
    segment
FROM v_rfm_label
"""

In [4]:
df_rfm = pd.read_sql(query, engine)
df_rfm.head()

,customerid,recency,frequency,monetary,r_score,f_score,m_score,rfm_score,segment
0,13298,0.0,1,360.00,1,4,4,144,At Risk
1,17144,0.0,2,984.57,1,3,2,132,Others
2,13077,0.0,4,728.02,1,2,3,123,Hibernating
3,16688,0.0,4,1260.86,1,2,2,122,Hibernating
4,14621,0.0,5,1788.36,1,2,2,122,Hibernating

In [5]:
df_rfm.to_csv("rfm_result.csv", index=False)

In [6]:
len(df_rfm)
df_rfm["segment"].value_counts()

segment
Others                1182
Hibernating           1110
Champions              904
Loyal Customers        535
At Risk                312
Potential Loyalist     295
Name: count, dtype: int64